-- $Name:Пробуждение$
-- $Version: 0.04$
-- $Author: Irremann$

require "parser/mp-ru"
require "fmt"
require "snd"

game.dsc = '^';

function init()
	mp.togglehelp = true;
	pl.word = -"я/мр,1л";
	pl.description = 'Я не хочу смотреть на себя.';
	pl.capacity = 1;
end;

cutscene {
	nam = 'main';
	text = {
		'Моё сознание покачивалось на мягких волнах сна, я видел разные вещи и явления. Так продолжалось долго, я не знаю сколько, но внезапно что-то поменялось..';
		'Человек, его кожа покрыта морщинами, особенно вокруг глаз. Старик - всплыло слово. Его губы шевелятся, он говорит, что-то важное..^-- Это завершающий сеанс гипнообучения. Сейчас ты проснешься и вступишь во владение новым миром. По нашим подсчётам планета должна будет очиститься от радиации к твоему пробуждению. Но не торопись, проверь показания приборов. А если наружние датчики повреждены, то используй скафандр и возьми пробы воздуха и почвы.';
		'Старик вздохнул. -- Знай, ты особенный. Ты первый. Ты должен всё проверить и только потом пробуждать твоих братьев и сестёр. Для этого ты должен нажать на красный рубильник на пульте возле ваших капсул.^-- Если ты обнаружишь, что радиация всё-таки проникла в этот бункер и кто-то из них развился неправильно и деформирован, то в комнатах снизу вы сможете найти все необходимые инструменты для исправления этого.^-- Удачи тебе и всем остальным. И не повторяйте ошибок нашей погибшей цивилизации.. -- Изображение мигнуло и исчезло.';
		'Перед моими глазами оказалось полупрозрачная поверхность. Я в какой-то жидкости, уровень которой вдруг стал стремительно снижаться, потом крышка откинулась и я скользя и отчаянно извиваясь в попытках за что-то ухватиться, вывалился наружу. Я лежу на полу. Я попробовал встать, но только как-то странно изогнулся. Что происходит? Мой взгляд остановился на блестящей поверхности основания капсулы, я увидел своё искажённое отражение и закричал от ужаса, но моё горло издало только странное мяуканье..';
		'Спустя какое-то время я очнулся. С содроганием я снова посмотрел в отражающую металлическую поверхность. Старик был прав про проникновение радиации. Моё тело оказалось абсолютно непохожим на человеческое. Сегменты покрытые чешуёй и жесткой шерстью, множество лапок поддерживающих всё это. Передний сегмент практически полностью занимала огромная клыкастая пасть. Я гусеница-переросток. Я горько рассмеялся, но из этой пасти снова вышло только мяуканье.';
	};
	next_to = 'Бункер';
};


room {
	nam = 'Бункер';
	dsc = 'Вдоль стен бункера идут вертикальные ряды капсул. С одной стороны есть проём ведущий в туннель. С другой стороны закрытая дверь.';
	obj = {'Капсулы', 'Туннель', 'Пульт', 'Рычаг', 'Дверь'};
	u_to = 'Туннель';
};

obj {
	-"капсулы|капсула";
	nam = 'Капсулы';
	description = 'Одна из них открыта. Это моя. Первая от выхода. На остальных индикаторы горят зелёным.';
	before_Enter = 'Я почему-то уверен что у меня не получится вернуться в капсулу и всё забыть.';
}:attr 'static';

door {
	-"проём|туннель";
	nam = 'Туннель';
	description = 'Туннель ведёт куда-то вверх. Половина ламп в нём не работает.';
	door_to = 'Тамбур';
}:attr 'open,scenery';

obj {
	-"пульт|индикаторы";
	nam = 'Пульт';
	description = 'Посередине пульта я вижу большой красный рычаг.';
	before_Climb = 'Я поскрёбся своими лапками о подножие пульта, но поверхность совершенно гладкая.';
}:attr 'static';

obj {
	-"рычаг|рубильник";
	nam = 'Рычаг';
	description = function()
		if here()^'Бункер' then
			p 'Большой красный рубильник, который запустит процесс активации остальных капсул.';
		elseif here()^'Тамбур' then
			p 'Ещё один рычаг. И опять нужны руки чтобы его нажать. Думали ли создатели бункера, что у меня не будет такой возможности?';
		end;
	end;
	['before_Pull,Push'] = 'Слишком высоко! Я не смогу отсюда до него добраться!';
}: attr 'scenery';

door {
	-"дверь";
	nam = 'Дверь';
	description = 'Эта дверь видимо ведёт ещё в какие-то помещения бункера.';
	door_to = 'Тамбур';
	before_Open = 'Я не смогу дотянутся до ручки. Слишком высоко.';
}:attr 'scenery, openable';

room {
	nam = 'Тамбур';
	onenter = function(s)
		if visits(s) == 0 then
			p 'Туннель плавно вёл вверх и сделав пару поворотов я вышел в новое помещение. По пути я обнаружил что отлично вижу в темноте. Ну хоть что-то.';
		end;
	end;
	dsc = 'Это тамбур бункера. Отсюда я могу вернуться вниз или выйти наружу. Над дверью наружу я заметил индикаторы.';
	obj = {'Индикаторы', 'Скафандр', 'Рычаг', 'Шлюз'};
	out_to = 'Шлюз';
	d_to = 'Бункер';
};

obj {
	-"индикаторы";
	nam = 'Индикаторы';
	description = 'Уровень радиации, содержание кислорода, уровень освещенности, скорость ветра. Ветер показывает ноль. Освещенность 900 едениц -- это закат или просто пасмурный день. Кислород 18%. Радиация в зеленом секторе. Похоже старик оказался прав по срокам восстановления планеты.';
}:attr 'scenery';

obj {
	-"скафандр";
	nam = 'Скафандр';
	description = function()
		if _'Шлюз':has 'open' then
			p 'Части скафандра рассыпаны по полу.';
		else
			p 'Массивный скафандр с защитой от радиации.';
		end;
	end;
	before_Take = function()
		if _'Шлюз':has 'open' then
			p 'Части скафандра слишком крупные. Я не могу их утащить.';
		else
			p 'Я не могу его взять. Мне нечем.';
		end;
	end;
	before_Wear = 'Даже если я залезу внутрь, мне это не поможет.';
	before_Push = function(s)
		if s:once() then
			p 'Я толкнул скафандр, тот легко качнулся. О, это идея! Я тщательно рассчитал угол и разбежавшись толкнул скафандр, его детали рассыпались по всему полу, а шлем зацепился за рычаг. Рычаг заскрипел и медленно пошёл вниз. Что-то зашипело и внешняя дверь открылась.';
			_'Шлюз':attr 'open';
		else
			p 'Я покатал скафандр по полу. Безрезультатно.';
		end;
	end;
}:attr 'static';

door {
	-"шлюз|дверь";
	nam = 'Шлюз';
	description = 'Эта дверь ведёт из бункера наружу.';
	door_to = 'Равнина';
	before_Open = 'Рычаг справа от двери открывает дверь.';
	before_Close = 'Я не смогу теперь закрыть дверь, да и не стоит этого делать.';
}:attr 'scenery, openable';

room {
	nam = 'Равнина';
	onenter = function(s)
		if visits(s) == 0 then
			p 'Я выполз наружу. Ветер гонит серые облака по небу. Похоже что датчик ветра всё-таки неисправен.';
		end;
	end;
	dsc = 'Вокруг меня покрытая редкими кустиками растений каменистая равнина. Я возле двери в бункер.';
	obj = {'Шлюз2', 'Камни', 'Кусты', 'Равнина2'};
	in_to = 'Шлюз2';
	cant_go = function(s, to)
		if to == 'u_to' then
			p 'Я забрался на холм и осмотрелся. Но вокруг оказалось всё одно и тоже. Камни и кустики растений. Где-то далеко на горизонте видны какие-то тёмные пятна, лес или вода? Но в любом случае мне туда недобраться. Слишком далеко. В разочаровании я спустился обратно к шлюзу.';
		else
			p 'Вокруг только эта каменистая пустошь без ориентиров. Мой радиус обзора невелик и я могу просто потерять бункер. Да и бродить тут просто так бессмысленно.';
		end;
	end;
};

door {
	-"шлюз|дверь|бункер";
	nam = 'Шлюз2';
	description = 'Дверь бункера вделана в бетонную стену выглядывающую из склона небольшой возвышенности, так же поросшей растениями.';
	door_to = 'Тамбур';
	before_Close = 'Я не смогу теперь закрыть дверь, да и не стоит этого делать.';
}:attr 'scenery, openable, open';

obj {
	-"камни|камень";
	nam = 'Камни';
	description = 'Камни разного размера, от булыжников, до мелкого гравия. Некоторые похоже когда-то были бетоном и кирпичами.';
	before_Take = function()
		if not have 'Булыжник' then
			p 'Я взял в пасть обломок среднего размера.';
			put('Булыжник', me());
		else
			p 'Больше одного камня за раз я не утащу.';
		end;
	end;
}:attr 'scenery';

obj {
	-"равнина";
	nam = 'Равнина2';
	description = 'Чахлые кустики растут на обломках старой цивилизации.';
}:attr 'scenery';

obj {
	-"булыжник|обломок|камень";
	nam = 'Булыжник';
	description = 'Булыжник среднего размера.';
	before_Drop = function(s, w)
		if here()^'Бункер' then
			if seen(s) then
				p 'Я выплюнул второй камень рядом с первым.';
				walk 'Конец';
			else
				p 'Я выплюнул камень на пол перед пультом. Мне понадобится ещё немало камней.';
				drop(s);
			end;
		else
			p 'Я выплюнул камень. Он невкусный.';
			drop(s);
		end;
	end;
	before_PutOn = function(s, w)
		if w^'Пульт' then
			p 'Слишком высоко, я не смогу закинуть камень на пульт.';
		else
			return false;
		end;
	end;
};

obj {
	-"кусты|кустики|трава|растение|растения";
	nam = 'Кусты';
	description = 'Какая-то жесткая трава, покрытая фиолетовыми соцветиями. Насколько я вижу везде растёт только это растение.';
	before_Eat = 'Я откусил и прожевал стебель. Как ни странно оказалось вкусно.';
}:attr 'scenery';

room {
	nam = 'Конец';
	dsc = 'Если навалить сюда достаточно камней, то получится пандус, по которому я смогу забраться на пульт и нажать на рычаг. Не знаю сколько времени это займет, месяцы точно. И как отреагируют на меня остальные. Поймут ли они, что я тоже разумен, если у меня нет способов это показать?^^^Автор: Irremann^Игра написана специально для Инстедоз-6.^Спасибо за прохождение.';
	noparser = true;
};
