mp.autohelp = true
mp.autohelp_limit = 13
mp.autohelp_noverbs = true
mp.prompt = "» "
mp.cursor = "▌"
function mp:MetaHelp()

	pn("{$fmt b|КАК ИГРАТЬ?}")

	pn([[Вводите ваши действия в виде простых предложений вида: глагол -- существительное. Например:^
» открыть дверь^
» отпереть дверь ключом^
» идти на север^
» взять кепку^
^
Чтобы осмотреть предмет, введите "осмотреть книгу" или просто "книга".^
^
Чтобы осмотреть всю сцену, наберите "осмотреть" или нажмите "ввод".^
^
Для того чтобы узнать, что вы носите с собой, наберите "инвентарь".^
^
Для перемещений используйте стороны света, например: "идти на север" или "север" или просто "с".
Кроме сторон света можно перемещаться вверх ("вверх" или "вв") и вниз ("вниз" или "вн").
^^
Вы можете воспользоваться клавишей "TAB" для автодополнения ввода.
]])
end
